In [1]:
import sqlite3
import pandas as pd

In [5]:
con = sqlite3.connect(r"d:\classroom\hr.db")

In [6]:
df = pd.read_sql("select * from employees",con)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   id        9 non-null      int64
 1   fullname  9 non-null      object
 2   job       9 non-null      object
 3   salary    9 non-null      int64
dtypes: int64(2), object(2)
memory usage: 416.0+ bytes

In [7]:
df

   id         fullname       job    salary
0   1    Scott Guthrie        TL   2000000
1   2  Anders Helsberg        PL   3000000
2   3             Mike  Sr. Prog   2000000
3   4             Jack  Jr. Prog    600000
4   5         Marshall        TL   3000000
5   6            Karry        Tl   2500000
6   7            Kevin       DBA  20000000
7   8          Roberts             1000000
8   9              Bob        TL   2500000

In [9]:
df['hra'] = df.salary * 0.30

In [10]:
df

   id         fullname       job    salary        hra
0   1    Scott Guthrie        TL   2000000   600000.0
1   2  Anders Helsberg        PL   3000000   900000.0
2   3             Mike  Sr. Prog   2000000   600000.0
3   4             Jack  Jr. Prog    600000   180000.0
4   5         Marshall        TL   3000000   900000.0
5   6            Karry        Tl   2500000   750000.0
6   7            Kevin       DBA  20000000  6000000.0
7   8          Roberts             1000000   300000.0
8   9              Bob        TL   2500000   750000.0

In [11]:
df.groupby('job')['salary'].median()

job
             1000000
DBA         20000000
Jr. Prog      600000
PL           3000000
Sr. Prog     2000000
TL           2500000
Tl           2500000
Name: salary, dtype: int64

In [14]:
cur = con.cursor()
#cur.execute("drop table hra_employees")
df.to_sql("hra_employees",con, index=False)

### Excel Sheet

In [12]:
df.to_excel(r"d:\classroom\hr.xlsx", sheet_name="employees", index=False)